{
    "version": "https://jsonfeed.org/version/1",
    "title": "Global humanities",
    "description": "",
    "home_page_url": "https://globalhumanities.github.io/certificate",
    "feed_url": "https://globalhumanities.github.io/certificate/feed.json",
    "user_comment": "",
    "author": {
        "name": "Admin"
    },
    "items": [
        {
            "id": "https://globalhumanities.github.io/certificate/certificate-2/index.html",
            "url": "https://globalhumanities.github.io/certificate/certificate-2/index.html",
            "title": "Certificate",
            "summary": "The Global Humanities Certificate invites students to step beyond borders—intellectual, cultural, and creative—to explore what it means to be human in a rapidly&hellip;",
            "content_html": "<h4 class=\"align-center\"><span style=\"font-weight: 400;\">The Global Humanities Certificate invites students to step beyond borders—intellectual, cultural, and creative—to explore what it means to be human in a rapidly changing world. Through interdisciplinary study of literature, art, philosophy, and history, the program encourages critical thinking and creativity by engaging students with global perspectives in three main areas: how cultures shape ideas, how imagination and the arts connect people, and how stories and histories reveal and reshape our collective identities.</span></h4>\n<h4><span style=\"font-weight: 400;\">Mission statement</span></h4>\n<p><span style=\"font-weight: 400;\">Global Humanities certificate offers students the opportunity to step outside their own traditions and see the world from distinct global perspectives. Exploring ideas and artifacts – literary, visual, material, artistic, etc. – in varied global contexts, the certificate will open the humanities to</span><span style=\"font-weight: 400;\"> all students across the network, including those in other fields. Incorporating the array of disciplines and approaches that comprise the humanities, its courses explore the human experience through diffe</span><span style=\"font-weight: 400;\">rent global lenses and help students engage with and navigate an increasingly complex global context. Familiarity with the humanities gives students a richer and more nuanced basis for their future work and contribution as citizens, offering an ethical, aesthetic, and historical foundation for understanding contemporary global problems and ways of living.</span></p>\n<p><a href=\"https://globalhumanities.github.io/certificate/values-and-program-goals-2/index.html\" class=\"button fit\">Values and program goals</a></p>\n<p><a href=\"https://globalhumanities.github.io/certificate/requirements/index.html\" class=\"button fit\">Requirements</a></p>",
            "author": {
                "name": "Admin"
            },
            "tags": [
            ],
            "date_published": "2025-10-14T23:29:51-05:00",
            "date_modified": "2025-10-22T15:31:00-05:00"
        }
    ]
}
